src/test/resources/web/services/nsiv2/reserveConfirmed.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <ns6:nsiHeader xmlns:ns6="http://schemas.ogf.org/nsi/2013/04/framework/headers" xmlns:ns5="http://www.w3.org/2000/09/xmldsig#" xmlns:ns4="http://www.w3.org/2001/04/xmlenc#"
            xmlns:ns3="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns2="http://schemas.ogf.org/nsi/2013/04/connection/types">
            <protocolVersion>application/vdn.ogf.nsi.cs.v2.requester+soap</protocolVersion>
            <correlationId>urn:uuid:5c716e15-c17c-481e-885d-c9a5c06e0436</correlationId>
            <requesterNSA>urn:ogf:network:nsa:surfnet-nsi-requester</requesterNSA>
            <providerNSA>urn:ogf:network:nsa:surfnet.nl</providerNSA>
        </ns6:nsiHeader>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns2:reserveConfirmed xmlns:ns6="http://schemas.ogf.org/nsi/2013/04/framework/headers" xmlns:ns5="http://www.w3.org/2000/09/xmldsig#" xmlns:ns4="http://www.w3.org/2001/04/xmlenc#"
            xmlns:ns3="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns2="http://schemas.ogf.org/nsi/2013/04/connection/types">
            <connectionId>ea1c4286-3eb7-4190-b95d-160a76c14c3e</connectionId>
            <globalReservationId>
                urn:nl:surfnet:diensten:bod:5ef163c8-9775-4dcd-8ed6-39fd6cd508c9
            </globalReservationId>
            <description>A NSI reserve test</description>
            <criteria version="0">
                <schedule>
                    <startTime>2013-07-29T10:51:00+02:00</startTime>
                    <endTime>2013-07-29T11:01:00+02:00</endTime>
                </schedule>
                <bandwidth>100</bandwidth>
                <serviceAttributes />
                <path>
                    <directionality>Bidirectional</directionality>
                    <sourceSTP>
                        <networkId>urn:ogf:network:stp:surfnet.nl</networkId>
                        <localId>21</localId>
                        <labels>
                            <attribute type="">
                                <value />
                            </attribute>
                        </labels>
                    </sourceSTP>
                    <destSTP>
                        <networkId>urn:ogf:network:stp:surfnet.nl</networkId>
                        <localId>24</localId>
                        <labels>
                            <attribute type="">
                                <value />
                            </attribute>
                        </labels>
                    </destSTP>
                </path>
            </criteria>
        </ns2:reserveConfirmed>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
